/**
 * Created by GoLand.
 * User: xzghua@gmail.com
 * Date: 2019-01-12
 * Time: 19:34
 */
package conf

var Msg  = map[int]string{

	//default
	400001000: "表单参数解析失败,请检查代码",
	400001001: "控制器参数断言失败,请检查后再试",
	400001002: "数据类型转换失败,请检查后再试",
	400001003: "表单参数获取失败,请检查后再试",

	//post
	401000000: "文章标题不能为空,请检查后再试",
	401000001: "文章分类不能为空,请检查后再试",
	401000002: "文章标签不能为空,请检查后再试",
	401000003: "文章摘要不能为空,请检查后再试",
	401000004: "表单参数获取失败,请检查后再试",
	401000005: "图片上传失败,请检查后再试",

	//cate
	402000000: "查询分类数据失败,请检查后再试",
	402000001: "获取分类数据列表失败,请检查后再试",
	402000002: "分类名不能为空,请检查后再试",
	402000003: "分类别名不能为空,请检查后再试",
	402000004: "分类父级不能为空,请检查后再试",
	402000005: "分类描述不能为空,请检查后再试",
	402000006: "分类名长度超出范围,请检查后再试",
	402000007: "分类别名长度超出范围,请检查后再试",
	402000008: "分类描述长度超出范围,请检查后再试",
	402000009: "分类修改失败,请检查后再试",

	//tag

	//system
}

